-- made by { @Mc_Dev1 }
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "السلام عليكم" -- msg 
rs[1] = "وعليكم السلام" -- reply

ws[3] = "بوت" -- msg
rs[3] = "عيوني" -- reply

ws[4] = "تحبني" -- msg 
rs[4] = "اكيد" -- reply

ws[5] = "شكد" -- msg 
rs[5] = "بكد شعر رجلي" -- reply

ws[6] = "ديفد" -- msg
rs[6] = "يمه يمه هذا السواني" -- reply

ws[7] = "بوت بوت" -- msg
rs[7] = "شلطشت يمعود" -- reply

ws[8] = "فوكاها" -- msg 
rs[8] = " غير انتو تشلعون الكلب بس انطوني فنتك" -- reply

ws[9] = "لا زعلت بعد" -- msg 
rs[9] = "لتخاف ماكلك حقك عليهة" -- reply

ws[10] = "لا بعد زعلت" -- msg
rs[10] = "طبك مرض اتوسل بيك اني" -- reply

ws[11] = "ليش" -- msg
rs[11] = "تعاركت الشرطه و الجيش" -- reply

ws[12] = "قديمه" -- msg 
rs[12] = "احلف مرتين" -- reply

ws[13] = "هلاو" -- msg 
rs[13] = "لا هلا و ميه هلا" -- reply

ws[14] = "@mc_dev1" -- msg 
rs[14] = "يمه يمه المطور مالتيشلونكم" -- reply

ws[15] = "شلونكم" -- msg 
rs[15] = "اني بالنسبه الي بوت و ماشغليل تعرف بعد" -- reply

ws[16] = "ضوجه" -- msg 
rs[16] = "تعال افرك ضهري" -- reply

ws[5] = "هلو" -- msg 
rs[5] = "يا هلا يا هلا نورت/ي" -- reply

ws[5] = "دير بالك عليهم" -- msg 
rs[5] = "تامر ياب من عيني" -- reply

ws[12] = "اني" -- msg 
rs[12] = "لا ابوي😘" -- reply

ws[14] = "تخليني" -- msg 
rs[14] = "اذا ما اخليك لعد منو يخليك" -- reply

ws[15] = "انجب" -- msg 
rs[15] = "هاي علي؟ تره اخذ غراضي و افلت خلي الكروب يفيدك" -- reply

ws[16] = "كلخره" -- msg 
rs[16] = "ايا منحرف/ه ايا سربـــوت/ه/" -- reply

ws[17] = "😕" -- msg 
rs[17] = "عاوج حلكك عليمن تعدله لو اجي اعدله الك" -- reply

ws[18] = "احبك" -- msg 
rs[18] = "كلبي اموت بيك/ج😘" -- reply

ws[19] = "صخام" -- msg 
rs[19] = "😏اليصخمك😒" -- reply

ws[20] = "بنيه" -- msg 
rs[20] = "😒 متدرين شــون الله مطـيــح حظج😈" -- reply

ws[21] = "انت منو يمك" -- msg 
rs[21] = "كبر كمت تتعيقل علي😈" -- reply

ws[22] = "تحب جوجو" -- msg 
rs[22] = "لك أّمُِـٍْـّْწყღწــًوت عليه احبه اكثر منك😼💔" -- reply

ws[23] = "كروبكم" -- msg 
rs[23] = "انجب حشري شبي الكروب🍃😹" -- reply

ws[24] = "هههه" -- msg 
rs[24] = "❤️دووووم❤️الضحكه 🙈" -- reply

ws[24] = "ههه" -- msg 
rs[24] = "❤️دووووم❤️الضحكه 🙈" -- reply

ws[24] = "ههههه" -- msg 
rs[24] = "❤️دووووم❤️الضحكه 🙈" -- reply

ws[24] = "هههههه" -- msg 
rs[24] = "❤️دووووم❤️الضحكه 🙈" -- reply

ws[24] = "ههههههه" -- msg 
rs[24] = "❤️دووووم❤️الضحكه 🙈" -- reply

ws[25] = "😳" -- msg 
rs[25] = "🌚وجه التنكه شبيك مصدوم😏" -- reply

ws[26] = "حموده" -- msg 
rs[26] = "❤ ️" -- reply

ws[27] = "محمد" -- msg 
rs[27] = "😨 صـہـاككے اڵـہـكڕۆب 🙈 ۿـہـۮا  💜😻" -- reply

ws[28] = "مرحبا" -- msg 
rs[28] = "😻مـــراحــب😘" -- reply

ws[29] = "حسن" -- msg 
rs[29] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply

ws[30] = "حسوني" -- msg 
rs[30] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply

ws[31] = "حيدر" -- msg ء سثس4ء سثس4
rs[31] = "مــعـ😻ــذب الكـgяθυρـٍْـْْروب 🌚🌹" -- replyءق يلائ  ءق ي

ws[32] = "حسون" -- msg 
rs[32] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply

ws[33] = "🍃😹" -- msg 
rs[33] = "بزونه داحسك" -- reply

ws[34] = "اندعيلي" -- msg 
rs[34] = "كـون تـموت" -- reply

ws[35] = "امريكي" -- msg 
rs[35] = "شكد احب الامريكان<3" -- reply

ws[36] = "سوسو" -- msg 
rs[36] = "العثه مال كروب" -- reply

ws[37] = "منتظر" -- msg 
rs[37] = "نستله و الباقي تشريب" -- reply

ws[38] = "اخوي" -- msg 
rs[38] = "وينه اخوك ,  عاد حلو لا😍" -- reply

ws[39] = "صفا" -- msg 
rs[39] = "😍صفاوي نوتيلا والباقي نستله ام الربع😻🍃" -- reply

ws[40] = "نستله" -- msg 
rs[40] = "😋ايــبـــاه🎈نـــــوبــه 🐹بــس مــال🎈 اكــل😋" -- rep

ws[41] = "تمام" -- msg
rs[41] = "دوم يارب دۈۈۈۈمْ}⌣" -- rep

ws[42] = "دوم" -- msg
rs[42] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَبْضّ قَلبْگ/ۈۈمْ}⌣" -- rep

ws[43] = "منور" -- msg
rs[43] = "نِْـِْـــِْ([💡])ِْــــًِـًًْـــِْـِْـِْـورِْكِْ" -- rep

ws[44] = "ها" -- msg
rs[44] = "هاي اجلون شغله هاذي" -- rep

ws[45] = "شكرا" -- msg
rs[45] = "العفو كل الهلا" -- rep

ws[46] = "وينك" -- msg
rs[46] = "بالتواليت" -- rep

ws[47] = "انته وين" -- msg
rs[47] = "بابيــت" -- rep

ws[48] = "وين" -- msg
rs[48] = "وره البيت اشوفك الطيور" -- rep

ws[49] = "بوسه" -- msg
rs[49] = "مويحححححححححح😘😚" -- rep

ws[50] = "السلام عليكم" -- msg 
rs[50] = "وعليكم السلام كل الهلاَ" -- reply

ws[51] = "طن" -- msg 
rs[51] = "هششششش كش عاااااع" -- reply

ws[52] = "زاحف" -- msg 
rs[52] = "زاحف على اختك من قبل️" -- reply

ws[53] = "اتفل" -- msg 
rs[53] = "💦ـووووو💦تفوووو" -- reply

ws[55] = "بوت" -- msg
rs[55] = "شنو التريده" -- reply

ws[57] = "علي" -- msg 
rs[57] = "يمه يمه فدوه" -- reply

ws[58] = "عمر" -- msg 
rs[58] = "<3😻" -- reply

ws[59] = "انكليزي" -- msg 
rs[59] = "اعرف احجي انكلوزو" -- reply

ws[60] = "روسيا" -- msg 
rs[60] = "فدوه لبناتهه نفر نفر" -- reply

ws[60] = "حمودي" -- msg 
rs[61] = "ابو العمبه فديت ربه" -- reply

ws[62] = "كم بي" 
rs[62] = "اخر مره لتغلط" 

ws[62] = "لا والله" 
rs[62] = "وحق الله" 

ws[64] = "شلونهم" -- msg
rs[64] = "الحمدلله وانت🍃" -- reply

ws[65] = "دووم" -- msg 
rs[65] = "يدوم نبضك 🍃" -- reply

ws[66] = "شونك"
rs[66] = "الحمدلله وانته"

ws[67] = "شلونك"
rs[67] = "الحمد لله وانت"

ws[68] = "غنيلي"
rs[68] = "بيدك يضل بوق الحرب ططن ططن ططن"

ws[69] = "شغل البوت"
rs[69] = " تم التهكير بنجاح للعضه و العبره ❄️"

ws[70] = "طفي البوت"
rs[70] = "لاتدخل لا اطفي عقلك"

ws[71] = "شغل السبلت"
rs[71] = "لان حميت انت"

ws[72] = "ميا خليفه"
rs[72] = "عيب ياب تره السيد موجود"

ws[73] = "فطور"
rs[73] = "وين اكو رمضان تره خلص"

ws[74] = "عيب"
rs[74] = "بالجيب"

ws[75] = "اجه"
rs[75] = "ابو الكوجه"

ws[76] = "تخليني"
rs[76] = "اي ابدي يلا"

ws[77] = "زاحففف"
rs[77] = "هاي عود انته جبير"

ws[78] = "تركيا"
rs[78] = "😐فديتهه"

ws[79] = "داعش"
rs[79] = "دي طز بيهم نفر نفر😒❤️"

ws[80] = "الدولة الاسلامية"
rs[80] = "انته داعشي ؟؟ 💔"

ws[81] = "سني"
rs[81] = "لتصير طائفي 😒"

ws[82] = "شيعي"
rs[82] = "لتصير طائفي اخر مره احذرك"

ws[83] = "تبادل"
rs[83] = "مانريد تبادل كافي لعدنه"

ws[84] = "العراقيين"
rs[84] = "احلى ناس ولله 😍🙈"

ws[85] = "من وين"
rs[85] = "شعليك زاحف 😂🔥 "

ws[86] = "هاي"
rs[86] = "هايات 🙈🍷"

ws[87] = "البوت"
rs[87] = "شبي ماعاجبك ؟"

ws[88] = "البوت واكف"
rs[88] = "لتجذب 😒ارجوك"

ws[89] = "منو ديحذف رسائلي"
rs[89] = "هسه شرايد"

ws[90] = "كلاش اوف كلانس"
rs[90] = "تلعبهه ؟ شكد لفلك ؟"

ws[91] = "جوني"
rs[91] = "مأذيك ؟"

ws[92] = "ازحف "
rs[92] = "على اختك زاحف قبل ؟؟! lol"

ws[93] = "نايمين"
rs[93] = "😹لتدخل بحي"

ws[94] = "مطور"
rs[94] = "💋😍تعال يصيحولك @mc_dev1"

ws[95] = "مضوي"
rs[95] = "الله لا يطفيك"

ws[96] = "اصطخفر الله"
rs[96] = "😭😿كرهت الحاتات و كرهت الدجاجات و كرهت الايجات من وراج جنان"

ws[97] = "تلي"
rs[97] = "هسه شتريد"

ws[98] = "فدوه"
rs[98] = "يمه يمه 😍💋"

ws[99] = "المنصور"
rs[99] = " احلى ناس ولله "

ws[100] = "المدرسه"
rs[100] = "اهووو هم رجعنه"

ws[101] = "تحبني"
rs[101] = " هوايه 😍🙈😍"

ws[102] = "يعني شكد"
rs[102] = "فوك ممتصور"

ws[103] = "😂"
rs[103] = "دوم حياتي"

ws[104] = "هههههههه"
rs[104] = " دوم حبي ❤️"

ws[106] = "ههههههههه"
rs[106] = "دوم عمري <3"

ws[107] = "😹"
rs[107] = "دوم يا حيوان"

ws[93] = ""
rs[93] = ""

ws[109] = "😍"
rs[109] = " مح فديتك"

ws[110] = "محح"
rs[110] = " فوديتك❤️"

ws[111] = "انمي"
rs[111] = " انته اوتاكو ؟ ❤️"

ws[112] = "منحرف"
rs[112] = "وينه حطرده"

ws[113] = "😭"
rs[113] = " 😢😢 لتبجي"

ws[114] = "😢"
rs[114] = "  لتبجي 😭😭"

ws[115] = "😂شكد عمرك"
rs[155] = "زاحفه"

ws[116] = "شكد عمرج"
rs[116] = " زاحف 😂"

ws[117] = "دعاء"
rs[117] = "اكو شي اسمه جامع لو مجلس😂😂😂"

ws[118] = "غبي"
rs[118] = "طالع عليك"

ws[119] = "دي"
rs[119] = "لا يا حيوان"

ws[120] = "منو حبيبتك"
rs[120] = " اختك 🙈"

ws[121] = "تكرهني"
rs[121] = " يب😈"

ws[122] = "اكرهك"
rs[122] = " علساس اني احبك تهي بهي 😒🍃"

ws[123] = "😂"
rs[123] = " دوم حبي ❤️"

ws[124] = "الاعظمية"
rs[124] = " احسن و افضل ناس❤️"

ws[125] = "الكرادة"
rs[125] = " احسن و افضل ناس❤️"

ws[126] = "شارع فلسطين"
rs[126] = " احسن و افضل ناس❤️"

ws[127] = "ممكن ملف"
rs[127] = "لو يجي البعبع"

ws[128] = "😇"
rs[128] = "  اته مو ملاك اته جهنم بنفسهه 😂"

ws[129] = "😐"
rs[129] = " شبيك صافن يمعود🔥"

ws[130] = "انجب"
rs[130] = " وك😞"

ws[131] = "حارة"
rs[131] = "يي كولش 🔥"

ws[132] = "خالتك"
rs[132] = " راح اطردك لك 😒"

ws[133] = "اطرد البوت"
rs[133] = "مو محترمك والله"

ws[134] = "هه"
rs[134] = "شنو تحس"

ws[135] = "شدتحس"
rs[135] = "داحس بيك"

ws[136] = "اكولك"
rs[136] = "لتكول"

ws[137] = "اكلك"
rs[137] = "لتكول شي"

ws[138] = "بغداد"
rs[138] = " 😍اخ الله"

ws[139] = "البصرة"
rs[139] = " احسن و افضل ناس❤️"

ws[140] = "تركماني"
rs[140] = " والنعم منك❤️"

ws[141] = "يا سورس هذا"
rs[141] = "Zafer >> {@Mc_Dev1}"

ws[142] = "باي"
rs[142] = " بايات ❤️🍃"

ws[143] = "تنح"
rs[143] = "عيب يابه"

ws[144] = "جوعان"
rs[144] = "اكل الي بالك هسه"

ws[145] = "عطشان"
rs[145] = "روح اشرب مي"

ws[146] = "صايم"
rs[146] = "كل تبن اعتقد مراح تفطر"

ws[147] = "☹️"
rs[147] = "لضوج حبيبي 😢"

ws[148] = "😔"
rs[148] = " ليش الحلو ضايج ❤️🍃"

ws[149] = "فرخ"
rs[149] = " عيبب😱"

ws[150] = "كسمك"
rs[150] = "اخر تحذير"

ws[151] = "نعال"
rs[151] = " بوجهك😂"

ws[152] = "حروح اسبح"
rs[152] = " واخيراً يا وصخ 😂"

ws[153] = "حروح اغسل"
rs[153] = " واخيراً 😂"

ws[154] = "حروح اطب للحمام"
rs[154] = " واخيراً هسه فرحت 😂"

ws[155] = "حبيبتي"
rs[155] = " منو هاي 😱 تخوني"

ws[156] = "كبلت"
rs[156] = "علخير"

ws[157] = "البوت عاوي"
rs[157] = "اطردك ؟؟؟؟ جاوب علسريع"

ws[158] = "منور"
rs[158] = " بنورك حبي 😍🍷"

ws[159] = "افلش"
rs[159] = " افلش راسك"

ws[160] = "كردي"
rs[160] = "والنعم منك ❤️"

ws[161] = "طفي السبلت"
rs[161] = "كل تبن"

ws[162] = "🌝"
rs[162] = "هه"

ws[163] = "اذن المغرب"
rs[163] = "استحرم يلمؤمن"

ws[164] = "حلو"
rs[164] = "انت الاحلى 🌚❤️"

ws[165] = "🌚" -- msg
rs[165] = "منور صخام الجدر" -- rep

ws[166] = "غني" -- msg 
rs[166] = "بدل متسمع اغاني روح اقره كم كلمه من كتاب الله "

ws[167] = "غنيي" -- msg 
rs[167] = "لا تظربني لا تظرب 💃💃 كسرت الخيزارانه💃🎋 صارلي سنه وست اشهر💃💃 من ظربتك وجعانه🤒😹"

ws[168] = "نونة" -- msg 
rs[168] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[169] = "ضحى" -- msg 
rs[169] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[170] = "لولو" -- msg 
rs[170] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[171] = "هدى" -- msg 
rs[171] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[172] = "زوزو" -- msg 
rs[172] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[173] = "زينة" -- msg 
rs[173] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply


ws[174] = "بنو" -- msg 
rs[174] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[175] = "بنين" -- msg 
rs[175] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  💜" -- reply

ws[176] = "شغال" -- msg 
rs[176] = "  يـاب 😻  " -- reply

ws[177] = "نور" -- msg 
rs[177] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  😻💜" -- reply

ws[178] = "ورده" -- msg 
rs[178] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  😻💜" -- reply
ws[179] = "وردة" -- msg 
rs[179] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  😻💜" -- reply

ws[180] = "ريماس" -- msg 
rs[180] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  😻💜" -- reply

ws[181] = "فرح" -- msg 
rs[181] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  😻💜" -- reply

ws[182] = "نصر" -- msg 
rs[182] ="اخـہـخ 😨 صـہـاكك اڵـہـكڕۆب هذا 🏻️  😻💜" -- reply
-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		send_large_msg ( R , rs[i] );
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mc_DAIVED" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mc_Dev1" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end
--Creat By @Mc_Dev1
